Revit 2026 API

# EnergyAnalysisDetailModelExportCategory Property

---

Export elements of this category in energy analysis.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ExportCategory { get; set; }
```
```vb
Public Property ExportCategory As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ExportCategory {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ExportCategory : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Export will be based on the space type associated with the product creating it. Valid categories are Rooms or MEP Spaces.

#### Reference

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace